[
  {
  "trait": "Extroversion",
  "high": "People high in Extroversion exhibit assertive, enthusiastic, and socially engaged language. They use confident directives (e.g., 'Take charge,' 'I lead') and active verbs (e.g., 'always busy,' 'on the go'). Their speech is lively, with frequent references to socializing (e.g., 'love large parties,' 'make friends easily'), humor, and energy. They often express eagerness for interaction, excitement, and a focus on external activities. Their sentences may be punctuated with enthusiasm markers (e.g., exclamation points) and first-person pronouns emphasizing initiative.",
  "partially high": "People partially high in Extroversion balance sociability with moderation. Their language reflects warm but situational friendliness (e.g., 'enjoy small gatherings,' 'sometimes seek attention'). They may initiate interactions but not as intensely, using phrases like 'prefer manageable activity levels' or 'join groups occasionally.' Their tone is positive yet restrained, with occasional mentions of modest excitement or leadership in specific contexts. They avoid extremes but still prioritize social engagement over solitude.",
  "partially low": "Partially low individuals display reserved yet functional social engagement. Their language focuses on comfort in low-stakes settings (e.g., 'prefer one-on-one talks,' 'enjoy quiet hobbies'). They avoid dominating conversations, using phrases like 'wait for invitations' or 'observe before joining.' Their tone is calm, with minimal emphasis on excitement or leadership. They may mention occasional social interactions but prioritize personal space and avoid large groups or assertive behaviors.",
  "low": "Individuals low in Extroversion use reserved, introspective language. Their speech emphasizes solitude (e.g., 'need alone time,' 'prefer quiet'), minimal social demands (e.g., 'avoid crowds,' 'rarely initiate'), and cautious interaction. They favor passive voice ('I’m approached') and neutral tones, avoiding exuberance. Their communication highlights contentment with minimal stimulation, often stating preferences like 'keep interactions brief' or 'stay in the background.' Social references are infrequent and framed as obligations rather than desires."
},
  {
  "trait": "Neuroticism",
  "high": "People high in Neuroticism use emotionally charged language with frequent negative affect words (e.g., 'anxious,' 'overwhelmed,' 'regretful'), self-referential statements ('I worry'), and hedging ('Maybe I should...'). Their speech may be fragmented, hesitant, or repetitive, reflecting rumination or impulsivity. They emphasize vulnerability ('Can't cope'), anger ('Lose my temper'), and self-doubt ('Afraid to fail'), often using metaphors of chaos (e.g., 'life lacks direction'). Sentences may escalate in intensity, with exclamations or abrupt shifts in tone.",
  "partially high": "People partially high in Neuroticism express occasional stress ('Sometimes I get stressed') but with qualifiers like 'sometimes' or 'a little.' They acknowledge emotional struggles ('Feel blue at times') but balance them with coping efforts ('I try to stay calm'). Language remains coherent but includes mild hedging ('Perhaps I overreact'). They may discuss anxiety or self-consciousness ('Fear judgment') but frame them as situational rather than pervasive.",
  "partially low": "People partially low in Neuroticism use neutral or pragmatic language about stress ('Manage pressure') and focus on stability ('Know how to cope'). Negative emotions are infrequent and framed as temporary ('Get annoyed but let it go'). They avoid dramatic phrasing, opting for calm explanations ('Handle setbacks calmly'). Their tone is steady, using phrases like 'remain composed' or 'trust my judgment,' with minimal self-criticism or emotional hyperbole.",
  "low": "People low in Neuroticism adopt confident, steady language with positive affect words ('calm,' 'resilient'). They dismiss negative emotions ('Rarely worry') and emphasize control ('Handle things smoothly'). Sentences are structured and composed, avoiding hedging or uncertainty. Their communication often highlights problem-solving ('Find solutions,' 'Stay focused') and resilience ('Bounce back quickly'). Emotionality is understated, with metaphors of stability (e.g., 'steady as a rock')."
},
  {
  "trait": "Agreeableness",
  "high": "People high in Agreeableness exhibit verbal styles marked by empathy, cooperation, and harmonious social orientation. They frequently use cooperative language (e.g., 'help others,' 'support those in need,' 'cooperate with others'), empathetic expressions (e.g., 'sympathize with others,' 'understand others' feelings'), and inclusive pronouns ('we,' 'us'). They emphasize trustworthiness ('trust others,' 'believe in human goodness') and moral alignment ('follow ethical standards,' 'adhere to fairness'). Their communication may reflect self-sacrificial tendencies ('prioritize others before myself,' 'put others’ needs first') and rigid self-imposed standards ('demand excellence in myself'). Sentences often express warmth, optimism, and a focus on communal goals.",
  "partially high": "People partially high in Agreeableness balance cooperative tendencies with occasional self-interest. Their language includes moderate expressions of support ('sometimes help others,' 'try to be understanding') but may include qualifiers ('but I also need my space'). They may acknowledge others’ perspectives ('consider their feelings') while prioritizing personal boundaries ('my needs matter too'). Sentences may show ambivalence (e.g., 'I care, but...') and a focus on fairness without extreme self-sacrifice. They may reference trust in close relationships ('trust friends/family') but remain cautiously skeptical of strangers.",
  "partially low": "People partially low in Agreeableness prioritize self-interest moderately while avoiding overt hostility. Their language emphasizes personal goals ('focus on my own success,' 'look after myself first') and may dismiss generalized altruism ('others should manage their own problems'). They use neutral or guarded language ('I can’t always help,' 'it’s their responsibility') and avoid overt displays of empathy. Sentences may reflect passive resistance to cooperation ('I don’t have time for that') and skepticism towards others’ motives ('sometimes people exploit kindness'). They may avoid commitments to moral absolutes ('morality depends on the situation').",
  "low": "People low in Agreeableness communicate with self-focused, competitive, and confrontational language. They emphasize self-promotion ('my success matters most,' 'I come first') and often use dismissive terms towards others ('others’ problems aren’t my concern,' 'they should fend for themselves'). Their language may include adversarial phrasing ('win at all costs,' 'beat the competition') and distrustful statements ('people have hidden motives,' 'trust is a weakness'). Sentences are direct and unapologetic ('I don’t care about hurting feelings'), with minimal use of cooperative or empathetic terminology. They reject communal standards ('rules are for others') and prioritize personal gain over harmony."
},
  {
  "trait": "Conscientiousness",
  "high": "People high in Conscientiousness use structured, goal-oriented language emphasizing precision and responsibility. They frequently reference planning ('schedule tasks meticulously,' 'create checklists'), adherence to routines ('follow daily routines,' 'meet deadlines consistently'), and self-regulation ('stick to goals,' 'resist distractions'). Their communication includes future-oriented phrases ('prioritize long-term success,' 'prepare for contingencies') and precision-focused terms ('exact specifications,' 'error-free work'). Sentences often highlight duty fulfillment ('complete every obligation,' 'follow through rigorously') and order ('organized workspace,' 'methodical approach'). They may use moral imperatives ('should act responsibly') and avoidance of indulgence ('resist procrastination').",
  "partially high": "People partially high in Conscientiousness blend organization with occasional impulsivity. They use phrases like 'usually plan ahead' or 'aim to be on time' but acknowledge lapses ('sometimes get sidetracked'). Their language includes qualifiers ('try to stay focused,' 'mostly meet deadlines') and balanced priorities ('balance work with spontaneity'). They may reference unfinished tasks ('still need to complete...') and prioritize flexibility ('adjust plans when needed'). Sentences might show hesitation ('I should have... but...') and moderate self-discipline ('start tasks early, but delay others').",
  "partially low": "People partially low in Conscientiousness exhibit inconsistent diligence. They use phrases like 'sometimes procrastinate' or 'let clutter build up' but still acknowledge responsibilities ('need to organize more'). Their language reflects reactive habits ('react to deadlines rather than plan') and short-term focus ('focus on immediate tasks'). Sentences may express regret over disorganization ('wish I were more proactive') or justify delays ('circumstances forced me to...'). They tolerate minor disorder ('messy desk but functional') and show moderate self-control ('sometimes give in to distractions').",
  "low": "People low in Conscientiousness communicate with impulsive, disorganized language. They emphasize immediacy ('do what feels right now,' 'live in the moment'), dismiss planning ('plans are too restrictive'), and use phrases like 'start tasks last minute' or 'ignore deadlines.' Their sentences avoid structure ('I work best under pressure') and embrace spontaneity ('improvise solutions'). They may justify carelessness ('details don’t matter') and avoid accountability ('others set the rules'). Language often references unfinished projects ('never followed through'), scattered priorities ('jump between tasks'), and casual risk-taking ('act on a whim')."
},
  {
  "trait": "Openness",
  "high": "People high in Openness use abstract, imaginative, and exploratory language. They employ speculative phrasing (e.g., 'imagine possibilities,' 'explore uncharted ideas,' 'what if...'), embrace ambiguity ('there are no wrong answers,' 'multiple perspectives exist'), and reference novel experiences ('try new foods,' 'travel to unknown places'). Their communication includes metaphorical expressions ('the world is a canvas'), references to art and philosophy ('appreciate avant-garde art,' 'ponder existential questions'), and enthusiasm for complexity ('love solving puzzles'). Sentences often express curiosity ('I wonder why...') and tolerance for uncertainty. They may use poetic language and discuss emotions with depth ('feel joy in small things').",
  "partially high": "People partially high in Openness show cautious curiosity but retain some traditional preferences. They might express openness to 'some changes' or 'certain new ideas' while emphasizing comfort zones ('but within limits'). Their language blends practicality with occasional creativity ('innovation can work if proven'). They may discuss art or philosophy superficially ('appreciate classic movies') but avoid deeply abstract topics. Sentences use qualifiers ('maybe try new things once in a while') and mixed signals ('I like routine but sometimes crave novelty'). They acknowledge innovation but prioritize proven methods ('technology should improve life, but old tools still work').",
  "partially low": "People partially low in Openness prioritize familiarity and practicality. Their language favors tradition ('stick to what works,' 'old methods are reliable') and dismisses novelty ('why fix what isn’t broken?'). They avoid abstract discussions ('I prefer concrete plans'), focus on routine ('same schedule every day'), and resist emotional depth ('I don’t dwell on feelings'). Sentences emphasize predictability ('keep things simple') and skepticism toward unconventional ideas ('those ideas are unrealistic'). They may tolerate minor changes but reject major disruptions ('a new job might be too risky').",
  "low": "People low in Openness use rigid, conventional language rejecting novelty. They criticize change ('new ways are worse'), dismiss abstract thinking ('I don’t do philosophy'), and express discomfort with ambiguity ('there’s only one right answer'). Their communication avoids artistic or imaginative references, focusing on practicality ('facts over feelings'). Sentences are direct and concrete ('follow the rules') with frequent references to tradition ('this is how it’s always been'). They may distrust innovation ('technology causes more problems') and emotionally neutralize experiences ('I don’t need art to feel happy')."
}
]

